# -*- coding: utf8 -*-
# 符号表
SYMBOLS = {'}': '{', ']': '[', ')': '('}
SYMBOLS_L, SYMBOLS_R = SYMBOLS.values(), SYMBOLS.keys()


def check(s):
    arr = []
    for c in s:
        if c in SYMBOLS_L:
            # 左符号入栈
            arr.append(c)
        elif c in SYMBOLS_R:
            # 右符号要么出栈，要么匹配失败
            if arr and arr[-1] == SYMBOLS[c]:
                arr.pop()
            else:
                return False

    return not arr


def check_two(s):
    arr1 = ['{', '[', '(']
    arr2 = ['}', ']', ')']
    arr3 = ['\"', '\'']
    for i in s:
        if i in arr3:
            print(1)


if __name__ == '__main__':
    # print(check("3 * {3 +[(2 -3) * (4+5)]}"))
    # print(check("3 * {3+ [4 - 6}]"))
    print(check_two([
        {'id': '1', '手机号': '07F9D470D3264AE5E5CC5C07254BB4AE', '姓名': 'FAE4CCFC61446C10B9B974649FF28246',
         '身份证号': '0199083AFAD1BC7EC9B99F390813D4D7', '手机号前四位': '1866', '结果': '',
         'phone': '07F9D470D3264AE5E5CC5C07254BB4AE', 'name': 'FAE4CCFC61446C10B9B974649FF28246',
         'id_number': '0199083AFAD1BC7EC9B99F390813D4D7', 'mobile_prefix': '1866', 'result': ''},
        {'id': '2', '手机号': '61F462753B8CC503C980E4BD4FD6836E', '姓名': 'C6888F44D75F9499B5D4ED639452C8BB',
         '身份证号': '4F90C852E838741B4CADDB3FD034B3E9', '手机号前四位': '1888', '结果': '',
         'phone': '61F462753B8CC503C980E4BD4FD6836E', 'name': 'C6888F44D75F9499B5D4ED639452C8BB',
         'id_number': '4F90C852E838741B4CADDB3FD034B3E9', 'mobile_prefix': '1888', 'result': ''},
        {'id': '3', '手机号': 'FF2B0ED430A0A7A184F3A07745937C41', '姓名': '8C091C70810273EBE866F2E30F43EB81',
         '身份证号': 'AC5D2332BA36F242AD50ED8D326DEBF7', '手机号前四位': '1361', 'phone': 'FF2B0ED430A0A7A184F3A07745937C41',
         'name': '8C091C70810273EBE866F2E30F43EB81', 'id_number': 'AC5D2332BA36F242AD50ED8D326DEBF7',
         'mobile_prefix': '1361'}]))
    s = [{'ID': '1', '姓名': '陈菊', '手机号': '18883871232', '身份证号': '500382199308210021', 'id': '1', 'phone': '18883871232',
          'name': '陈菊', 'id_number': '500382199308210021'},
         {'ID': '2', '姓名': '陈军', '手机号': '13320297563', '身份证号': '500237198607146750', 'id': '2', 'phone': '13320297563',
          'name': '陈军', 'id_number': '500237198607146750'},
         {'ID': '3', '姓名': '陈启虎', '手机号': '13983823625', '身份证号': '500381196610170614', 'id': '3',
          'phone': '13983823625', 'name': '陈启虎', 'id_number': '500381196610170614'},
         {'ID': '4', '姓名': '陈腾', '手机号': '13212695651', '身份证号': '510282198203161616', 'id': '4', 'phone': '13212695651',
          'name': '陈腾', 'id_number': '510282198203161616'},
         {'ID': '5', '姓名': '陈洋', '手机号': '18983909779', '身份证号': '500222198310258618', 'id': '5', 'phone': '18983909779',
          'name': '陈洋', 'id_number': '500222198310258618'},
         {'ID': '6', '姓名': '董志刚', '手机号': '18623503042', '身份证号': '511124197408085511', 'id': '6',
          'phone': '18623503042', 'name': '董志刚', 'id_number': '511124197408085511'},
         {'ID': '7', '姓名': '杜昆伦', '手机号': '13629733435'}]
