# coding=utf-8
import csv
import os
import re
from pypinyin import pinyin, lazy_pinyin, Style

def get_dict(pykey, data):

    # 去标点符号
    # temp = data.decode("utf8")
    temp = re.sub("[\s+\.\!\/_,$%^*(+\"\']+|[+——！，。？、~@#￥%……&*（）()<>{}「」《》' ：: ? ;]+", "",data)
    print(temp)
    temp_reslut = pinyin(temp)
    print(temp_reslut)

    unknow_pinyin = {}

    for i in temp_reslut:
        # print(i[0])
        if i[0] in pykey:
            pykey[i[0]] = pykey[i[0]] + 1
            print(pykey[i[0]] )
            # print(i)
        elif i[0] in unknow_pinyin:
            unknow_pinyin[i[0]] = unknow_pinyin[i[0]] +1
            print(unknow_pinyin[i[0]])
        else:
            unknow_pinyin.setdefault(i[0], 1)
            print(unknow_pinyin[i[0]])

    # print(pykey)
    # print(unknow_pinyin)
    print('pykey:================>>>>>>>>>>')
    # print(sorted(pykey.items(), key=lambda x:x[1], reverse=True))
    for i  in sorted(pykey.items(), key=lambda x:x[1], reverse=True):
        print(i)
    print('unknow_pinyin:=========>>>>>>>>')
    # print(sorted(unknow_pinyin.items(), key=lambda x:x[1], reverse=True))
    for j in sorted(unknow_pinyin.items(), key=lambda x:x[1], reverse=True):
        print(j)
    return


def get_dict_2(pykey, data):

    # 去标点符号
    # temp = data.decode("utf8")
    temp = re.sub("[\s+\.\!\/_,$%^*(+\"\']+|[+——！，。？、~@#￥%……&*（）()<>{}「」《》' ：: ? ;]+", "",data)
    print(temp)
    temp_reslut = pinyin(temp)
    # print(temp_reslut)


    for i in temp_reslut:
        # print(i[0])
        if i[0] in pykey:
            pykey[i[0]] = pykey[i[0]] + 1
            # print(pykey[i[0]] )
        else:
            pykey.setdefault(i[0], 1)
            # print(pykey[i[0]])

    # print(pykey)
    print('pykey:================>>>>>>>>>>')
    # print(sorted(pykey.items(), key=lambda x:x[1], reverse=True))
    for i  in sorted(pykey.items(), key=lambda x:x[1], reverse=True):
        print(i)
    return pykey






if __name__ == '__main__':
    ##### 手工录的KEY
    pykey = {'a': 0, 'ā': 0, 'á': 0, 'ǎ': 0, 'à': 0, 'ai': 0, 'āi': 0, 'ái': 0, 'ǎi': 0, 'ài': 0, 'ān': 0, 'án': 0,
             'ǎn': 0,
             'àn': 0, 'āng': 0, 'áng': 0, 'àng': 0, 'ao': 0, 'āo': 0, 'áo': 0, 'ǎo': 0, 'ào': 0, 'ba': 0, 'bā': 0,
             'bá': 0,
             'bǎ': 0, 'bà': 0, 'bai': 0, 'bāi': 0, 'bái': 0, 'bǎi': 0, 'bài': 0, 'ban': 0, 'bān': 0, 'bǎn': 0, 'bàn': 0,
             'bāng': 0, 'bǎng': 0, 'bàng': 0, 'bao': 0, 'bāo': 0, 'báo': 0, 'bǎo': 0, 'bào': 0, 'bei': 0, 'bēi': 0,
             'běi': 0, 'bèi': 0, 'bēn': 0, 'běn': 0, 'bèn': 0, 'bēng': 0, 'béng': 0, 'běng': 0, 'bèng': 0, 'bi': 0,
             'bī': 0,
             'bí': 0, 'bǐ': 0, 'bì': 0, 'bian': 0, 'biān': 0, 'biǎn': 0, 'biàn': 0, 'biao': 0, 'biāo': 0, 'biáo': 0,
             'biǎo': 0, 'biào': 0, 'biē': 0, 'bié': 0, 'biě': 0, 'biè': 0, 'bīn': 0, 'bìn': 0, 'bing': 0, 'bīng': 0,
             'bǐng': 0, 'bìng': 0, 'bo': 0, 'bō': 0, 'bó': 0, 'bǒ': 0, 'bò': 0, 'bu': 0, 'bū': 0, 'bú': 0, 'bǔ': 0,
             'bù': 0,
             'ca': 0, 'cǎ': 0, 'cà': 0, 'cāi': 0, 'cái': 0, 'cǎi': 0, 'cài': 0, 'can': 0, 'cán': 0, 'cǎn': 0, 'càn': 0,
             'cang': 0, 'cāng': 0, 'cáng': 0, 'càng': 0, 'cāo': 0, 'cáo': 0, 'cǎo': 0, 'cào': 0, 'ce': 0, 'cè': 0,
             'cēn': 0,
             'cén': 0, 'cēng': 0, 'céng': 0, 'cèng': 0, 'chā': 0, 'chá': 0, 'chǎ': 0, 'chà': 0, 'chāi': 0, 'chái': 0,
             'chǎi': 0, 'chài': 0, 'chān': 0, 'chán': 0, 'chǎn': 0, 'chàn': 0, 'chang': 0, 'chāng': 0, 'cháng': 0,
             'chǎng': 0, 'chàng': 0, 'chāo': 0, 'cháo': 0, 'chǎo': 0, 'chào': 0, 'chē': 0, 'chě': 0, 'chè': 0,
             'chen': 0,
             'chēn': 0, 'chén': 0, 'chěn': 0, 'chèn': 0, 'cheng': 0, 'chēng': 0, 'chéng': 0, 'chěng': 0, 'chèng': 0,
             'chi': 0, 'chī': 0, 'chí': 0, 'chǐ': 0, 'chì': 0, 'chōng': 0, 'chóng': 0, 'chǒng': 0, 'chòng': 0,
             'chou': 0,
             'chōu': 0, 'chóu': 0, 'chǒu': 0, 'chòu': 0, 'chu': 0, 'chū': 0, 'chú': 0, 'chǔ': 0, 'chù': 0, 'chuā': 0,
             'chuāi': 0, 'chuái': 0, 'chuǎi': 0, 'chuài': 0, 'chuān': 0, 'chuán': 0, 'chuǎn': 0, 'chuàn': 0,
             'chuāng': 0,
             'chuáng': 0, 'chuǎng': 0, 'chuàng': 0, 'chuī': 0, 'chuí': 0, 'chūn': 0, 'chún': 0, 'chǔn': 0, 'chuō': 0,
             'chuò': 0, 'ci': 0, 'cī': 0, 'cí': 0, 'cǐ': 0, 'cì': 0, 'cōng': 0, 'cóng': 0, 'còng': 0, 'còu': 0, 'cū': 0,
             'cú': 0, 'cù': 0, 'cuān': 0, 'cuán': 0, 'cuàn': 0, 'cuī': 0, 'cuǐ': 0, 'cuì': 0, 'cun': 0, 'cūn': 0,
             'cún': 0,
             'cǔn': 0, 'cùn': 0, 'cuō': 0, 'cuó': 0, 'cuǒ': 0, 'cuò': 0, 'da': 0, 'dā': 0, 'dá': 0, 'dǎ': 0, 'dà': 0,
             'dāi': 0, 'dǎi': 0, 'dài': 0, 'dān': 0, 'dǎn': 0, 'dàn': 0, 'dāng': 0, 'dǎng': 0, 'dàng': 0, 'dao': 0,
             'dāo': 0, 'dáo': 0, 'dǎo': 0, 'dào': 0, 'de': 0, 'dē': 0, 'dé': 0, 'dèn': 0, 'dēi': 0, 'děi': 0, 'deng': 0,
             'dēng': 0, 'děng': 0, 'dèng': 0, 'di': 0, 'dī': 0, 'dí': 0, 'dǐ': 0, 'dì': 0, 'diǎ': 0, 'dian': 0,
             'diān': 0,
             'diǎn': 0, 'diàn': 0, 'diāo': 0, 'diǎo': 0, 'diào': 0, 'die': 0, 'diē': 0, 'dié': 0, 'diè': 0, 'dīng': 0,
             'dǐng': 0, 'dìng': 0, 'diū': 0, 'dong': 0, 'dōng': 0, 'dǒng': 0, 'dòng': 0, 'dou': 0, 'dōu': 0, 'dóu': 0,
             'dǒu': 0, 'dòu': 0, 'du': 0, 'dū': 0, 'dú': 0, 'dǔ': 0, 'dù': 0, 'duān': 0, 'duǎn': 0, 'duàn': 0, 'duī': 0,
             'duǐ': 0, 'duì': 0, 'dun': 0, 'dūn': 0, 'dǔn': 0, 'dùn': 0, 'duo': 0, 'duō': 0, 'duó': 0, 'duǒ': 0,
             'duò': 0,
             'e': 0, 'ē': 0, 'é': 0, 'ě': 0, 'è': 0, 'ēi': 0, 'ēn': 0, 'ěn': 0, 'èn': 0, 'eng': 0, 'ēng': 0, 'er': 0,
             'ēr': 0, 'ér': 0, 'ěr': 0, 'èr': 0, 'fa': 0, 'fā': 0, 'fá': 0, 'fǎ': 0, 'fà': 0, 'fān': 0, 'fán': 0,
             'fǎn': 0,
             'fàn': 0, 'fang': 0, 'fāng': 0, 'fáng': 0, 'fǎng': 0, 'fàng': 0, 'fēi': 0, 'féi': 0, 'fěi': 0, 'fèi': 0,
             'fen': 0, 'fēn': 0, 'fén': 0, 'fěn': 0, 'fèn': 0, 'feng': 0, 'fēng': 0, 'féng': 0, 'fěng': 0, 'fèng': 0,
             'fo': 0, 'fó': 0, 'fóu': 0, 'fǒu': 0, 'fu': 0, 'fū': 0, 'fú': 0, 'fǔ': 0, 'fù': 0, 'ga': 0, 'gā': 0,
             'gá': 0,
             'gǎ': 0, 'gà': 0, 'gāi': 0, 'gǎi': 0, 'gài': 0, 'gān': 0, 'gǎn': 0, 'gàn': 0, 'gāng': 0, 'gǎng': 0,
             'gàng': 0,
             'gao': 0, 'gāo': 0, 'gǎo': 0, 'gào': 0, 'ge': 0, 'gē': 0, 'gé': 0, 'gě': 0, 'gè': 0, 'gěi': 0, 'gēn': 0,
             'gén': 0, 'gěn': 0, 'gèn': 0, 'geng': 0, 'gēng': 0, 'gěng': 0, 'gèng': 0, 'gōng': 0, 'gǒng': 0, 'gòng': 0,
             'gōu': 0, 'gǒu': 0, 'gòu': 0, 'gu': 0, 'gū': 0, 'gú': 0, 'gǔ': 0, 'gù': 0, 'gua': 0, 'guā': 0, 'guǎ': 0,
             'guà': 0, 'guāi': 0, 'guái': 0, 'guǎi': 0, 'guài': 0, 'guān': 0, 'guǎn': 0, 'guàn': 0, 'guāng': 0,
             'guǎng': 0,
             'guàng': 0, 'gui': 0, 'guī': 0, 'guǐ': 0, 'guì': 0, 'gǔn': 0, 'gùn': 0, 'guō': 0, 'guó': 0, 'guǒ': 0,
             'guò': 0, 'ha': 0, 'hā': 0, 'há': 0, 'hǎ': 0, 'hà': 0, 'hai': 0, 'hāi': 0, 'hái': 0, 'hǎi': 0, 'hài': 0,
             'han': 0, 'hān': 0, 'hán': 0, 'hǎn': 0, 'hàn': 0, 'hang': 0, 'hāng': 0, 'háng': 0, 'hàng': 0, 'hao': 0,
             'hāo': 0, 'háo': 0, 'hǎo': 0, 'hào': 0, 'he': 0, 'hē': 0, 'hé': 0, 'hè': 0, 'hēi': 0, 'hén': 0, 'hěn': 0,
             'hèn': 0, 'hēng': 0, 'héng': 0, 'hèng': 0, 'hōng': 0, 'hóng': 0, 'hǒng': 0, 'hòng': 0, 'hōu': 0, 'hóu': 0,
             'hǒu': 0, 'hòu': 0, 'hu': 0, 'hū': 0, 'hú': 0, 'hǔ': 0, 'hù': 0, 'hua': 0, 'huā': 0, 'huá': 0, 'huà': 0,
             'huái': 0, 'huài': 0, 'huān': 0, 'huán': 0, 'huǎn': 0, 'huàn': 0, 'huāng': 0, 'huáng': 0, 'huǎng': 0,
             'huàng': 0, 'hui': 0, 'huī': 0, 'huí': 0, 'huǐ': 0, 'huì': 0, 'hūn': 0, 'hún': 0, 'hǔn': 0, 'hùn': 0,
             'huō': 0,
             'huó': 0, 'huǒ': 0, 'huò': 0, 'ji': 0, 'jī': 0, 'jí': 0, 'jǐ': 0, 'jì': 0, 'jia': 0, 'jiā': 0, 'jiá': 0,
             'jiǎ': 0, 'jià': 0, 'jian': 0, 'jiān': 0, 'jián': 0, 'jiǎn': 0, 'jiàn': 0, 'jiang': 0, 'jiāng': 0,
             'jiǎng': 0,
             'jiàng': 0, 'jiāo': 0, 'jiáo': 0, 'jiǎo': 0, 'jiào': 0, 'jie': 0, 'jiē': 0, 'jié': 0, 'jiě': 0, 'jiè': 0,
             'jin': 0, 'jīn': 0, 'jǐn': 0, 'jìn': 0, 'jing': 0, 'jīng': 0, 'jǐng': 0, 'jìng': 0, 'jiōng': 0, 'jiǒng': 0,
             'jiu': 0, 'jiū': 0, 'jiǔ': 0, 'jiù': 0, 'ju': 0, 'jū': 0, 'jú': 0, 'jǔ': 0, 'jù': 0, 'juān': 0, 'juǎn': 0,
             'juàn': 0, 'juē': 0, 'jué': 0, 'juè': 0, 'jūn': 0, 'jùn': 0, 'ka': 0, 'kā': 0, 'kǎ': 0, 'kāi': 0, 'kǎi': 0,
             'kài': 0, 'kān': 0, 'kǎn': 0, 'kàn': 0, 'kāng': 0, 'káng': 0, 'kàng': 0, 'kao': 0, 'kāo': 0, 'kǎo': 0,
             'kào': 0, 'ke': 0, 'kē': 0, 'ké': 0, 'kě': 0, 'kè': 0, 'kěn': 0, 'kèn': 0, 'kēng': 0, 'kōng': 0, 'kǒng': 0,
             'kòng': 0, 'kōu': 0, 'kǒu': 0, 'kòu': 0, 'ku': 0, 'kū': 0, 'kǔ': 0, 'kù': 0, 'kua': 0, 'kuā': 0, 'kuǎ': 0,
             'kuà': 0, 'kuai': 0, 'kuǎi': 0, 'kuài': 0, 'kuan': 0, 'kuān': 0, 'kuǎn': 0, 'kuāng': 0, 'kuáng': 0,
             'kuǎng': 0,
             'kuàng': 0, 'kuī': 0, 'kuí': 0, 'kuǐ': 0, 'kuì': 0, 'kun': 0, 'kūn': 0, 'kǔn': 0, 'kùn': 0, 'kuò': 0,
             'la': 0,
             'lā': 0, 'lá': 0, 'lǎ': 0, 'là': 0, 'lai': 0, 'lāi': 0, 'lái': 0, 'lǎi': 0, 'lài': 0, 'lán': 0, 'lǎn': 0,
             'làn': 0, 'lāng': 0, 'láng': 0, 'lǎng': 0, 'làng': 0, 'lao': 0, 'lāo': 0, 'láo': 0, 'lǎo': 0, 'lào': 0,
             'le': 0, 'lē': 0, 'lè': 0, 'lei': 0, 'lēi': 0, 'léi': 0, 'lěi': 0, 'lèi': 0, 'lēng': 0, 'léng': 0,
             'lěng': 0,
             'lèng': 0, 'li': 0, 'lī': 0, 'lí': 0, 'lǐ': 0, 'lì': 0, 'liǎ': 0, 'lián': 0, 'liǎn': 0, 'liàn': 0,
             'liáng': 0,
             'liǎng': 0, 'liàng': 0, 'liāo': 0, 'liáo': 0, 'liǎo': 0, 'liào': 0, 'lie': 0, 'liě': 0, 'liè': 0, 'līn': 0,
             'lín': 0, 'lǐn': 0, 'lìn': 0, 'líng': 0, 'lǐng': 0, 'lìng': 0, 'liū': 0, 'liú': 0, 'liǔ': 0, 'liù': 0,
             'lóng': 0, 'lǒng': 0, 'lòng': 0, 'lou': 0, 'lōu': 0, 'lóu': 0, 'lǒu': 0, 'lòu': 0, 'lu': 0, 'lū': 0,
             'lú': 0,
             'lǔ': 0, 'lù': 0, 'lǘ': 0, 'lǚ': 0, 'lǜ': 0, 'luán': 0, 'luǎn': 0, 'luàn': 0, 'luè': 0, 'lüè': 0, 'lun': 0,
             'lūn': 0, 'lún': 0, 'lǔn': 0, 'lùn': 0, 'luo': 0, 'luō': 0, 'luó': 0, 'luǒ': 0, 'luò': 0, 'm': 0, 'ma': 0,
             'mā': 0, 'má': 0, 'mǎ': 0, 'mà': 0, 'mai': 0, 'mái': 0, 'mǎi': 0, 'mài': 0, 'man': 0, 'mān': 0, 'mán': 0,
             'mǎn': 0, 'màn': 0, 'māng': 0, 'máng': 0, 'mǎng': 0, 'mao': 0, 'māo': 0, 'máo': 0, 'mǎo': 0, 'mào': 0,
             'me': 0,
             'méi': 0, 'měi': 0, 'mèi': 0, 'men': 0, 'mēn': 0, 'mén': 0, 'mèn': 0, 'mēng': 0, 'méng': 0, 'měng': 0,
             'mèng': 0, 'mi': 0, 'mī': 0, 'mí': 0, 'mǐ': 0, 'mì': 0, 'mián': 0, 'miǎn': 0, 'miàn': 0, 'miāo': 0,
             'miáo': 0,
             'miǎo': 0, 'miào': 0, 'mie': 0, 'miē': 0, 'miè': 0, 'min': 0, 'mín': 0, 'mǐn': 0, 'ming': 0, 'míng': 0,
             'mǐng': 0, 'mìng': 0, 'miù': 0, 'mo': 0, 'mō': 0, 'mó': 0, 'mǒ': 0, 'mò': 0, 'mōu': 0, 'móu': 0, 'mǒu': 0,
             'mu': 0, 'mú': 0, 'mǔ': 0, 'mù': 0, 'na': 0, 'nā': 0, 'ná': 0, 'nǎ': 0, 'nà': 0, 'nái': 0, 'nǎi': 0,
             'nài': 0, 'nan': 0, 'nān': 0, 'nán': 0, 'nǎn': 0, 'nàn': 0, 'nāng': 0, 'náng': 0, 'nǎng': 0, 'nàng': 0,
             'nāo': 0, 'náo': 0, 'nǎo': 0, 'nào': 0, 'ne': 0, 'né': 0, 'nè': 0, 'něi': 0, 'nèi': 0, 'nèn': 0, 'néng': 0,
             'ng': 0, 'ni': 0, 'nī': 0, 'ní': 0, 'nǐ': 0, 'nì': 0, 'nian': 0, 'niān': 0, 'nián': 0, 'niǎn': 0,
             'niàn': 0,
             'niáng': 0, 'niàng': 0, 'niǎo': 0, 'niào': 0, 'niē': 0, 'nié': 0, 'niè': 0, 'nin': 0, 'nín': 0, 'nǐn': 0,
             'níng': 0, 'nǐng': 0, 'nìng': 0, 'niū': 0, 'niú': 0, 'niǔ': 0, 'niù': 0, 'nóng': 0, 'nǒng': 0, 'nòng': 0,
             'nou': 0, 'nóu': 0, 'nòu': 0, 'nu': 0, 'nú': 0, 'nǔ': 0, 'nù': 0, 'nǚ': 0, 'nǜ': 0, 'nuán': 0, 'nuǎn': 0,
             'nüè': 0, 'nuó': 0, 'nuò': 0, 'nún': 0, 'o': 0, 'ō': 0, 'ó': 0, 'ōu': 0, 'ǒu': 0, 'òu': 0, 'pa': 0,
             'pā': 0,
             'pá': 0, 'pà': 0, 'pai': 0, 'pāi': 0, 'pái': 0, 'pǎi': 0, 'pài': 0, 'pān': 0, 'pán': 0, 'pǎn': 0, 'pàn': 0,
             'pāng': 0, 'páng': 0, 'pǎng': 0, 'pàng': 0, 'pao': 0, 'pāo': 0, 'páo': 0, 'pǎo': 0, 'pào': 0, 'pei': 0,
             'pēi': 0, 'péi': 0, 'pěi': 0, 'pèi': 0, 'pēn': 0, 'pén': 0, 'pěn': 0, 'pèn': 0, 'peng': 0, 'pēng': 0,
             'péng': 0, 'pěng': 0, 'pèng': 0, 'pi': 0, 'pī': 0, 'pí': 0, 'pǐ': 0, 'pì': 0, 'piān': 0, 'pián': 0,
             'piǎn': 0,
             'piàn': 0, 'piāo': 0, 'piáo': 0, 'piǎo': 0, 'piào': 0, 'piē': 0, 'piě': 0, 'piè': 0, 'pin': 0, 'pīn': 0,
             'pín': 0, 'pǐn': 0, 'pìn': 0, 'ping': 0, 'pīng': 0, 'píng': 0, 'pǐng': 0, 'po': 0, 'pō': 0, 'pó': 0,
             'pǒ': 0,
             'pò': 0, 'pōu': 0, 'póu': 0, 'pǒu': 0, 'pu': 0, 'pū': 0, 'pú': 0, 'pǔ': 0, 'pù': 0, 'qi': 0, 'qī': 0,
             'qí': 0,
             'qǐ': 0, 'qì': 0, 'qiā': 0, 'qiá': 0, 'qiǎ': 0, 'qià': 0, 'qian': 0, 'qiān': 0, 'qián': 0, 'qiǎn': 0,
             'qiàn': 0, 'qiāng': 0, 'qiáng': 0, 'qiǎng': 0, 'qiàng': 0, 'qiāo': 0, 'qiáo': 0, 'qiǎo': 0, 'qiào': 0,
             'qiē': 0, 'qié': 0, 'qiě': 0, 'qiè': 0, 'qīn': 0, 'qín': 0, 'qǐn': 0, 'qìn': 0, 'qing': 0, 'qīng': 0,
             'qíng': 0, 'qǐng': 0, 'qìng': 0, 'qiōng': 0, 'qióng': 0, 'qiu': 0, 'qiū': 0, 'qiú': 0, 'qiǔ': 0, 'qu': 0,
             'qú': 0, 'qǔ': 0, 'qù': 0, 'quan': 0, 'quān': 0, 'quán': 0, 'quǎn': 0, 'quàn': 0, 'quē': 0, 'qué': 0,
             'què': 0,
             'qūn': 0, 'qún': 0, 'rán': 0, 'rǎn': 0, 'rāng': 0, 'ráng': 0, 'rǎng': 0, 'ràng': 0, 'ráo': 0, 'rǎo': 0,
             'rào': 0, 'rě': 0, 'rè': 0, 'rén': 0, 'rěn': 0, 'rèn': 0, 'rēng': 0, 'réng': 0, 'rèng': 0, 'ri': 0,
             'rì': 0,
             'rong': 0, 'róng': 0, 'rǒng': 0, 'róu': 0, 'rǒu': 0, 'ròu': 0, 'ru': 0, 'rú': 0, 'rǔ': 0, 'rù': 0,
             'ruán': 0,
             'ruǎn': 0, 'ruí': 0, 'ruǐ': 0, 'ruì': 0, 'rùn': 0, 'ruo': 0, 'ruó': 0, 'ruò': 0, 'sa': 0, 'sā': 0, 'sǎ': 0,
             'sà': 0, 'sai': 0, 'sāi': 0, 'sài': 0, 'san': 0, 'sān': 0, 'sǎn': 0, 'sàn': 0, 'sāng': 0, 'sǎng': 0,
             'sàng': 0,
             'sao': 0, 'sāo': 0, 'sǎo': 0, 'sào': 0, 'se': 0, 'sē': 0, 'sè': 0, 'sēn': 0, 'sēng': 0, 'shā': 0, 'shá': 0,
             'shǎ': 0, 'shà': 0, 'shāi': 0, 'shǎi': 0, 'shài': 0, 'shan': 0, 'shān': 0, 'shǎn': 0, 'shàn': 0,
             'shāng': 0,
             'shǎng': 0, 'shàng': 0, 'shao': 0, 'shāo': 0, 'sháo': 0, 'shǎo': 0, 'shào': 0, 'shē': 0, 'shé': 0,
             'shě': 0,
             'shè': 0, 'shéi': 0, 'shen': 0, 'shēn': 0, 'shén': 0, 'shěn': 0, 'shèn': 0, 'sheng': 0, 'shēng': 0,
             'shéng': 0,
             'shěng': 0, 'shèng': 0, 'shi': 0, 'shī': 0, 'shí': 0, 'shǐ': 0, 'shì': 0, 'shōu': 0, 'shóu': 0, 'shǒu': 0,
             'shòu': 0, 'shu': 0, 'shū': 0, 'shú': 0, 'shǔ': 0, 'shù': 0, 'shuā': 0, 'shuǎ': 0, 'shuà': 0, 'shuāi': 0,
             'shuǎi': 0, 'shuài': 0, 'shuān': 0, 'shuàn': 0, 'shuang': 0, 'shuāng': 0, 'shuǎng': 0, 'shuàng': 0,
             'shuí': 0,
             'shuǐ': 0, 'shuì': 0, 'shūn': 0, 'shǔn': 0, 'shùn': 0, 'shuō': 0, 'shuò': 0, 'si': 0, 'sī': 0, 'sǐ': 0,
             'sì': 0, 'sōng': 0, 'sǒng': 0, 'sòng': 0, 'sōu': 0, 'sǒu': 0, 'sòu': 0, 'su': 0, 'sū': 0, 'sú': 0, 'sù': 0,
             'suān': 0, 'suǎn': 0, 'suàn': 0, 'sui': 0, 'suī': 0, 'suí': 0, 'suǐ': 0, 'suì': 0, 'sūn': 0, 'sǔn': 0,
             'sùn': 0, 'suo': 0, 'suō': 0, 'suǒ': 0, 'suò': 0, 'ta': 0, 'tā': 0, 'tǎ': 0, 'tà': 0, 'tāi': 0, 'tái': 0,
             'tǎi': 0, 'tài': 0, 'tān': 0, 'tán': 0, 'tǎn': 0, 'tàn': 0, 'tāng': 0, 'táng': 0, 'tǎng': 0, 'tàng': 0,
             'tāo': 0, 'táo': 0, 'tǎo': 0, 'tào': 0, 'te': 0, 'tè': 0, 'tēng': 0, 'téng': 0, 'tèng': 0, 'tī': 0,
             'tí': 0,
             'tǐ': 0, 'tì': 0, 'tian': 0, 'tiān': 0, 'tián': 0, 'tiǎn': 0, 'tiàn': 0, 'tiāo': 0, 'tiáo': 0, 'tiǎo': 0,
             'tiào': 0, 'tiē': 0, 'tiě': 0, 'tiè': 0, 'tīng': 0, 'tíng': 0, 'tǐng': 0, 'tìng': 0, 'tōng': 0, 'tóng': 0,
             'tǒng': 0, 'tòng': 0, 'tōu': 0, 'tóu': 0, 'tǒu': 0, 'tòu': 0, 'tu': 0, 'tū': 0, 'tú': 0, 'tǔ': 0, 'tù': 0,
             'tuān': 0, 'tuán': 0, 'tuǎn': 0, 'tuàn': 0, 'tui': 0, 'tuī': 0, 'tuí': 0, 'tuǐ': 0, 'tuì': 0, 'tun': 0,
             'tūn': 0, 'tún': 0, 'tǔn': 0, 'tùn': 0, 'tuo': 0, 'tuō': 0, 'tuó': 0, 'tuǒ': 0, 'tuò': 0, 'wa': 0, 'wā': 0,
             'wá': 0, 'wǎ': 0, 'wà': 0, 'wāi': 0, 'wǎi': 0, 'wài': 0, 'wan': 0, 'wān': 0, 'wán': 0, 'wǎn': 0, 'wàn': 0,
             'wāng': 0, 'wáng': 0, 'wǎng': 0, 'wàng': 0, 'wei': 0, 'wēi': 0, 'wéi': 0, 'wěi': 0, 'wèi': 0, 'wen': 0,
             'wēn': 0, 'wén': 0, 'wěn': 0, 'wèn': 0, 'wēng': 0, 'wěng': 0, 'wèng': 0, 'wo': 0, 'wō': 0, 'wǒ': 0,
             'wò': 0,
             'wu': 0, 'wū': 0, 'wú': 0, 'wǔ': 0, 'wù': 0, 'xi': 0, 'xī': 0, 'xí': 0, 'xǐ': 0, 'xì': 0, 'xia': 0,
             'xiā': 0,
             'xiá': 0, 'xiǎ': 0, 'xià': 0, 'xian': 0, 'xián': 0, 'xiǎn': 0, 'xiàn': 0, 'xiāng': 0, 'xiáng': 0,
             'xiǎng': 0,
             'xiàng': 0, 'xiao': 0, 'xiāo': 0, 'xiáo': 0, 'xiǎo': 0, 'xiào': 0, 'xiē': 0, 'xié': 0, 'xiě': 0, 'xiè': 0,
             'xīn': 0, 'xín': 0, 'xǐn': 0, 'xìn': 0, 'xing': 0, 'xīng': 0, 'xíng': 0, 'xǐng': 0, 'xìng': 0, 'xiong': 0,
             'xiōng': 0, 'xióng': 0, 'xiǒng': 0, 'xiòng': 0, 'xiu': 0, 'xiū': 0, 'xiú': 0, 'xiǔ': 0, 'xiù': 0, 'xu': 0,
             'xū': 0, 'xú': 0, 'xǔ': 0, 'xù': 0, 'xuān': 0, 'xuán': 0, 'xuǎn': 0, 'xuàn': 0, 'xue': 0, 'xuē': 0,
             'xué': 0,
             'xuě': 0, 'xuè': 0, 'xun': 0, 'xūn': 0, 'xún': 0, 'xùn': 0, 'ya': 0, 'yā': 0, 'yá': 0, 'yǎ': 0, 'yà': 0,
             'yan': 0, 'yān': 0, 'yán': 0, 'yǎn': 0, 'yàn': 0, 'yang': 0, 'yāng': 0, 'yáng': 0, 'yǎng': 0, 'yàng': 0,
             'yao': 0, 'yāo': 0, 'yáo': 0, 'yǎo': 0, 'yào': 0, 'ye': 0, 'yē': 0, 'yé': 0, 'yě': 0, 'yè': 0, 'yi': 0,
             'yī': 0, 'yí': 0, 'yǐ': 0, 'yì': 0, 'yin': 0, 'yīn': 0, 'yín': 0, 'yǐn': 0, 'yìn': 0, 'ying': 0, 'yīng': 0,
             'yíng': 0, 'yǐng': 0, 'yìng': 0, 'yo': 0, 'yō': 0, 'yong': 0, 'yōng': 0, 'yóng': 0, 'yǒng': 0, 'yòng': 0,
             'you': 0, 'yōu': 0, 'yóu': 0, 'yǒu': 0, 'yòu': 0, 'yu': 0, 'yū': 0, 'yú': 0, 'yǔ': 0, 'yù': 0, 'yuān': 0,
             'yuán': 0, 'yuǎn': 0, 'yuàn': 0, 'yuē': 0, 'yuě': 0, 'yuè': 0, 'yun': 0, 'yūn': 0, 'yún': 0, 'yǔn': 0,
             'yùn': 0, 'za': 0, 'zā': 0, 'zá': 0, 'zǎ': 0, 'zai': 0, 'zāi': 0, 'zǎi': 0, 'zài': 0, 'zān': 0, 'zán': 0,
             'zǎn': 0, 'zàn': 0, 'zang': 0, 'zāng': 0, 'zǎng': 0, 'zàng': 0, 'zao': 0, 'zāo': 0, 'záo': 0, 'zǎo': 0,
             'zào': 0, 'ze': 0, 'zé': 0, 'zè': 0, 'zéi': 0, 'zěn': 0, 'zèn': 0, 'zēng': 0, 'zèng': 0, 'zha': 0,
             'zhā': 0,
             'zhá': 0, 'zhǎ': 0, 'zhà': 0, 'zhai': 0, 'zhāi': 0, 'zhái': 0, 'zhǎi': 0, 'zhài': 0, 'zhan': 0, 'zhān': 0,
             'zhán': 0, 'zhǎn': 0, 'zhàn': 0, 'zhang': 0, 'zhāng': 0, 'zhǎng': 0, 'zhàng': 0, 'zhao': 0, 'zhāo': 0,
             'zháo': 0, 'zhǎo': 0, 'zhào': 0, 'zhe': 0, 'zhē': 0, 'zhé': 0, 'zhě': 0, 'zhè': 0, 'zhèi': 0, 'zhen': 0,
             'zhēn': 0, 'zhěn': 0, 'zhèn': 0, 'zhēng': 0, 'zhěng': 0, 'zhèng': 0, 'zhi': 0, 'zhī': 0, 'zhí': 0,
             'zhǐ': 0,
             'zhì': 0, 'zhōng': 0, 'zhǒng': 0, 'zhòng': 0, 'zhou': 0, 'zhōu': 0, 'zhóu': 0, 'zhǒu': 0, 'zhòu': 0,
             'zhu': 0,
             'zhū': 0, 'zhú': 0, 'zhǔ': 0, 'zhù': 0, 'zhuā': 0, 'zhuǎ': 0, 'zhuāi': 0, 'zhuái': 0, 'zhuǎi': 0,
             'zhuài': 0,
             'zhuān': 0, 'zhuǎn': 0, 'zhuàn': 0, 'zhuāng': 0, 'zhuǎng': 0, 'zhuàng': 0, 'zhuī': 0, 'zhuǐ': 0, 'zhuì': 0,
             'zhūn': 0, 'zhǔn': 0, 'zhùn': 0, 'zhuo': 0, 'zhuō': 0, 'zhuó': 0, 'zi': 0, 'zī': 0, 'zí': 0, 'zǐ': 0,
             'zì': 0,
             'zōng': 0, 'zǒng': 0, 'zòng': 0, 'zōu': 0, 'zǒu': 0, 'zòu': 0, 'zu': 0, 'zū': 0, 'zú': 0, 'zǔ': 0,
             'zuān': 0,
             'zuǎn': 0, 'zuàn': 0, 'zuī': 0, 'zuǐ': 0, 'zuì': 0, 'zūn': 0, 'zǔn': 0, 'zùn': 0, 'zuo': 0, 'zuō': 0,
             'zuó': 0,
             'zuǒ': 0, 'zuò': 0}


    # data = ' 《红楼梦》<!@$#%^&*()>不敢面对现实，故作沉睡！逃避奋斗的过程，极其懦弱。时常做梦，是一种完全清醒的梦，梦想着奇迹出现，梦想人生路上，障碍自动清零，梦想脚下是平坦的康庄大道，梦想没有荆棘没有沟壑的人生路。可梦终究是梦，总有醒来的一天，睁开眼睛的那一刻，既然发现，脚下的那块，长长的巨石还在那里，阻挡着自己前行的脚步，前方那个半米宽的沟壑还在那里。这一切的一切，自己怎能不知，脚下障碍，没有人会帮自己去清理，但懦弱的自己，不敢面对眼前这一切，无限拖延着，不愿去推那块石头进前方的沟壑，害怕自己推不动，即使明白，不推是永远也不会知道，自己是否能推动，然而就是害怕失败，不去行动。于是闭上眼睛，等待着等待着上天的垂帘。自己如此虔诚，如此明白事理，如此这般的渴望达成的目标，上天怎能不眷顾，怎么可以不对自己好一点，怎么可以不帮自己，清理人生路上的障碍呢！我是明白世间真谛的人，我是能够把握，做好一件事情所有的规则和步骤。为什么不帮我清除障碍，倘若帮我清除障碍，我一定会做出一番令人艳羡的成绩。然而内心明白这样一道理，知道一件事怎么做，不一定代表你就会做了。当一个人，告诉你游泳时，手怎么划，脚该怎么动，你记住全部姿势，不会游泳的你，觉得此时学会游泳了吗？你如同小昭，背会乾坤大挪移心法，便能成为武林高手吗？考驾照，考完科一，熟悉所有交通规则，如此可以开车呢。一个人明白做事的规则，知道做事的步骤，不一定会做事！其实你明白，不愿意承认而已！有人说你异想天开，等着天上掉馅饼，你必定会反驳：你们怎么可以说，我是这种人，我怎会是这种人，我从来就没有想过，不劳而获，我所追求的，是通过自己的努力获得。'

    # py_result = pinyin(data)
    # print(py_result)


##################    # 去空格
    # data_strip = data.strip()
    #
    # py_strip_result = pinyin(data_strip)
    #
    # print(py_strip_result)

    # print(pinyin(line, style=Style.FINALS_TONE3))
    # print(pinyin(line))
#############################



    file_path = '/Users/edz/Desktop/sub-new-1.csv'
    f1 = open(file_path).read()
    # file_path2 = '/Users/edz/Desktop/sub-new-2.csv'
    # f2 = open(file_path2).read()
    # print(f1)
    # print(pinyin(f1))
    # get_dict(pykey, f1)
    print(get_dict_2(pykey, f1))

    ####### 从github的项目上拿到的新华字典里的拼音字典
    key_1 = {'á': 0, 'ā': 0, 'ái': 0, 'ài': 0, 'ǎi': 0, 'āi': 0, 'án': 0, 'àn': 0, 'ǎn': 0, 'ān': 0, 'ánɡ': 0, 'ànɡ': 0, 'ānɡ': 0, 'áo': 0, 'ào': 0, 'ǎo': 0, 'āo': 0, 'bá': 0, 'bà': 0, 'bǎ': 0, 'bā': 0, 'bái': 0, 'bài': 0, 'bǎi': 0, 'bāi': 0, 'bàike': 0, 'baiwǎ': 0, 'bàn': 0, 'bǎn': 0, 'bān': 0, 'bànɡ': 0, 'bǎnɡ': 0, 'bānɡ': 0, 'báo': 0, 'bào': 0, 'bǎo': 0, 'bāo': 0, 'béi': 0, 'bèi': 0, 'běi': 0, 'bēi': 0, 'bei0': 0, 'bèn': 0, 'běn': 0, 'bēn': 0, 'bénɡ': 0, 'bènɡ': 0, 'běnɡ': 0, 'bēnɡ': 0, 'bí': 0, 'bì': 0, 'bǐ': 0, 'bī': 0, 'biàn': 0, 'biǎn': 0, 'biān': 0, 'biào': 0, 'biǎo': 0, 'biāo': 0, 'bié': 0, 'biě': 0, 'biē': 0, 'bìn': 0, 'bīn': 0, 'bìnɡ': 0, 'bǐnɡ': 0, 'bīnɡ': 0, 'bo': 0, 'bó': 0, 'bò': 0, 'bǒ': 0, 'bō': 0, 'bú': 0, 'bù': 0, 'bǔ': 0, 'bū': 0, 'cà': 0, 'cǎ': 0, 'cā': 0, 'cái': 0, 'cài': 0, 'cǎi': 0, 'cāi': 0, 'cal': 0, 'cán': 0, 'càn': 0, 'cǎn': 0, 'cān': 0, 'cánɡ': 0, 'cànɡ': 0, 'cānɡ': 0, 'cáo': 0, 'cào': 0, 'cǎo': 0, 'cāo': 0, 'cè': 0, 'cén': 0, 'cēn': 0, 'cénɡ': 0, 'cènɡ': 0, 'cēnɡ': 0, 'ceok': 0, 'ceom': 0, 'ceon': 0, 'ceor': 0, 'chá': 0, 'chà': 0, 'chǎ': 0, 'chā': 0, 'chái': 0, 'chài': 0, 'chāi': 0, 'chán': 0, 'chàn': 0, 'chǎn': 0, 'chān': 0, 'chánɡ': 0, 'chànɡ': 0, 'chǎnɡ': 0, 'chānɡ': 0, 'cháo': 0, 'chào': 0, 'chǎo': 0, 'chāo': 0, 'chè': 0, 'chě': 0, 'chē': 0, 'chen': 0, 'chén': 0, 'chèn': 0, 'chěn': 0, 'chēn': 0, 'chénɡ': 0, 'chènɡ': 0, 'chěnɡ': 0, 'chēnɡ': 0, 'chí': 0, 'chì': 0, 'chǐ': 0, 'chī': 0, 'chónɡ': 0, 'chònɡ': 0, 'chǒnɡ': 0, 'chōnɡ': 0, 'chóu': 0, 'chòu': 0, 'chǒu': 0, 'chōu': 0, 'chu': 0, 'chú': 0, 'chù': 0, 'chǔ': 0, 'chū': 0, 'chuái': 0, 'chuài': 0, 'chuāi': 0, 'chuán': 0, 'chuàn': 0, 'chuǎn': 0, 'chuān': 0, 'chuánɡ': 0, 'chuànɡ': 0, 'chuǎnɡ': 0, 'chuānɡ': 0, 'chuí': 0, 'chuī': 0, 'chun': 0, 'chún': 0, 'chǔn': 0, 'chūn': 0, 'chuò': 0, 'chuō': 0, 'cí': 0, 'cì': 0, 'cǐ': 0, 'cī': 0, 'cis': 0, 'cónɡ': 0, 'cōnɡ': 0, 'còu': 0, 'cú': 0, 'cù': 0, 'cū': 0, 'cuán': 0, 'cuàn': 0, 'cuān': 0, 'cui': 0, 'cuì': 0, 'cuǐ': 0, 'cuī': 0, 'cún': 0, 'cùn': 0, 'cǔn': 0, 'cūn': 0, 'cuó': 0, 'cuò': 0, 'cuǒ': 0, 'cuō': 0, 'da': 0, 'dá': 0, 'dà': 0, 'dǎ': 0, 'dā': 0, 'dài': 0, 'dǎi': 0, 'dāi': 0, 'dàn': 0, 'dǎn': 0, 'dān': 0, 'dànɡ': 0, 'dǎnɡ': 0, 'dānɡ': 0, 'dào': 0, 'dǎo': 0, 'dāo': 0, 'de': 0, 'dé': 0, 'dem': 0, 'den': 0, 'dènɡ': 0, 'děnɡ': 0, 'dēnɡ': 0, 'dí': 0, 'dì': 0, 'dǐ': 0, 'dī': 0, 'diǎ': 0, 'diàn': 0, 'diǎn': 0, 'diān': 0, 'diào': 0, 'diǎo': 0, 'diāo': 0, 'dié': 0, 'diè': 0, 'diē': 0, 'dim': 0, 'dìnɡ': 0, 'dǐnɡ': 0, 'dīnɡ': 0, 'diu1': 0, 'dònɡ': 0, 'dǒnɡ': 0, 'dōnɡ': 0, 'dóu': 0, 'dòu': 0, 'dǒu': 0, 'dōu': 0, 'dú': 0, 'dù': 0, 'dǔ': 0, 'dū': 0, 'duàn': 0, 'duǎn': 0, 'duān': 0, 'duɡ': 0, 'duì': 0, 'duī': 0, 'dùn': 0, 'dǔn': 0, 'dūn': 0, 'duó': 0, 'duò': 0, 'duǒ': 0, 'duō': 0, 'e': 0, 'é': 0, 'è': 0, 'ě': 0, 'ē': 0, 'ēi': 0, 'én': 0, 'èn': 0, 'ěn': 0, 'ēn': 0, 'ēnɡ': 0, 'eo': 0, 'eol': 0, 'eos': 0, 'ér': 0, 'èr': 0, 'ěr': 0, 'èr发fā': 0, 'fá': 0, 'fà': 0, 'fǎ': 0, 'fā': 0, 'fán': 0, 'fàn': 0, 'fǎn': 0, 'fān': 0, 'fánɡ': 0, 'fànɡ': 0, 'fǎnɡ': 0, 'fānɡ': 0, 'féi': 0, 'fèi': 0, 'fěi': 0, 'fēi': 0, 'fén': 0, 'fèn': 0, 'fěn': 0, 'fēn': 0, 'fénɡ': 0, 'fènɡ': 0, 'fěnɡ': 0, 'fēnɡ': 0, 'fěnwǎ': 0, 'fiao': 0, 'fó': 0, 'fóu': 0, 'fǒu': 0, 'fú': 0, 'fù': 0, 'fǔ': 0, 'fū': 0, 'ɡá': 0, 'ɡà': 0, 'ɡǎ': 0, 'ɡā': 0, 'ɡài': 0, 'ɡǎi': 0, 'ɡāi': 0, 'ɡàn': 0, 'ɡǎn': 0, 'ɡān': 0, 'ɡanɡ': 0, 'ɡànɡ': 0, 'ɡǎnɡ': 0, 'ɡānɡ': 0, 'ɡào': 0, 'ɡǎo': 0, 'ɡāo': 0, 'ɡé': 0, 'ɡè': 0, 'ɡě': 0, 'ɡē': 0, 'ɡěi': 0, 'ɡén': 0, 'ɡèn': 0, 'ɡēn': 0, 'ɡènɡ': 0, 'ɡěnɡ': 0, 'ɡēnɡ': 0, 'ɡeu': 0, 'ɡib': 0, 'ɡo': 0, 'ɡònɡ': 0, 'ɡǒnɡ': 0, 'ɡōnɡ': 0, 'gōngfēn': 0, 'gǒngli': 0, 'ɡòu': 0, 'ɡǒu': 0, 'ɡōu': 0, 'gǔ': 0, 'ɡù': 0, 'ɡǔ': 0, 'ɡū': 0, 'ɡuà': 0, 'ɡuǎ': 0, 'ɡuā': 0, 'ɡuài': 0, 'ɡuǎi': 0, 'ɡuāi': 0, 'ɡuàn': 0, 'ɡuǎn': 0, 'ɡuān': 0, 'ɡuànɡ': 0, 'ɡuǎnɡ': 0, 'ɡuānɡ': 0, 'ɡuì': 0, 'ɡuǐ': 0, 'ɡuī': 0, 'ɡùn': 0, 'ɡǔn': 0, 'ɡuó': 0, 'ɡuò': 0, 'ɡuǒ': 0, 'ɡuō': 0, 'há': 0, 'hā': 0, 'hái': 0, 'hài': 0, 'hǎi': 0, 'hal': 0, 'han': 0, 'hán': 0, 'hàn': 0, 'hǎn': 0, 'hān': 0, 'hánɡ': 0, 'hànɡ': 0, 'hānɡ': 0, 'háo': 0, 'hào': 0, 'hǎo': 0, 'hāo': 0, 'haoke': 0, 'hé': 0, 'hè': 0, 'hē': 0, 'hèi': 0, 'hēi': 0, 'hén': 0, 'hèn': 0, 'hěn': 0, 'hénɡ': 0, 'hènɡ': 0, 'hēnɡ': 0, 'hol': 0, 'hónɡ': 0, 'hònɡ': 0, 'hǒnɡ': 0, 'hōnɡ': 0, 'hóu': 0, 'hòu': 0, 'hǒu': 0, 'hu': 0, 'hú': 0, 'hù': 0, 'hǔ': 0, 'hū': 0, 'huá': 0, 'huà': 0, 'huā': 0, 'huái': 0, 'huài': 0, 'huán': 0, 'huàn': 0, 'huǎn': 0, 'huān': 0, 'huánɡ': 0, 'huànɡ': 0, 'huǎnɡ': 0, 'huānɡ': 0, 'hui': 0, 'huí': 0, 'huì': 0, 'huǐ': 0, 'huī': 0, 'hún': 0, 'hùn': 0, 'hūn': 0, 'huó': 0, 'huò': 0, 'huǒ': 0, 'huō': 0, 'jí': 0, 'jì': 0, 'jǐ': 0, 'jī': 0, 'jiá': 0, 'jià': 0, 'jiǎ': 0, 'jiā': 0, 'jiàn': 0, 'jiǎn': 0, 'jiān': 0, 'jiànɡ': 0, 'jiǎnɡ': 0, 'jiānɡ': 0, 'jiáo': 0, 'jiào': 0, 'jiǎo': 0, 'jiāo': 0, 'jié': 0, 'jiè': 0, 'jiě': 0, 'jiē': 0, 'jìn': 0, 'jǐn': 0, 'jīn': 0, 'jínɡ': 0, 'jìnɡ': 0, 'jǐnɡ': 0, 'jīnɡ': 0, 'jiǒnɡ': 0, 'jiōnɡ': 0, 'jiù': 0, 'jiǔ': 0, 'jiū': 0, 'ju': 0, 'jú': 0, 'jù': 0, 'jǔ': 0, 'jū': 0, 'juàn': 0, 'juǎn': 0, 'juān': 0, 'jué': 0, 'juè': 0, 'juě': 0, 'juē': 0, 'jùn': 0, 'jūn': 0, 'kǎ': 0, 'kā': 0, 'kài': 0, 'kǎi': 0, 'kāi': 0, 'kal': 0, 'kàn': 0, 'kǎn': 0, 'kān': 0, 'kánɡ': 0, 'kànɡ': 0, 'kānɡ': 0, 'kào': 0, 'kǎo': 0, 'kāo': 0, 'ké': 0, 'kè': 0, 'kě': 0, 'kē': 0, 'kèn': 0, 'kěn': 0, 'kēnɡ': 0, 'keo': 0, 'keol': 0, 'keos': 0, 'keum': 0, 'ki': 0, 'kònɡ': 0, 'kǒnɡ': 0, 'kōnɡ': 0, 'kos': 0, 'kòu': 0, 'kǒu': 0, 'kōu': 0, 'kù': 0, 'kǔ': 0, 'kū': 0, 'kuà': 0, 'kuǎ': 0, 'kuā': 0, 'kuai': 0, 'kuài': 0, 'kuǎi': 0, 'kuǎn': 0, 'kuān': 0, 'kuánɡ': 0, 'kuànɡ': 0, 'kuǎnɡ': 0, 'kuānɡ': 0, 'kuí': 0, 'kuì': 0, 'kuǐ': 0, 'kuī': 0, 'kùn': 0, 'kǔn': 0, 'kūn': 0, 'kuò': 0, 'kweok': 0, 'la': 0, 'lá': 0, 'là': 0, 'lǎ': 0, 'lā': 0, 'lái': 0, 'lài': 0, 'lán': 0, 'làn': 0, 'lǎn': 0, 'lanɡ': 0, 'láng': 0, 'lánɡ': 0, 'lànɡ': 0, 'lǎnɡ': 0, 'lānɡ': 0, 'láo': 0, 'lào': 0, 'lǎo': 0, 'lāo': 0, 'le': 0, 'lè': 0, 'lei': 0, 'léi': 0, 'lèi': 0, 'lěi': 0, 'lénɡ': 0, 'lènɡ': 0, 'lěnɡ': 0, 'li': 0, 'lí': 0, 'lì': 0, 'lǐ': 0, 'lī': 0, 'lián': 0, 'liàn': 0, 'liǎn': 0, 'liān': 0, 'liánɡ': 0, 'liànɡ': 0, 'liǎnɡ': 0, 'liānɡ': 0, 'liáo': 0, 'liào': 0, 'liǎo': 0, 'liāo': 0, 'lie': 0, 'liè': 0, 'liě': 0, 'lín': 0, 'lìn': 0, 'lǐn': 0, 'līn': 0, 'línɡ': 0, 'lìnɡ': 0, 'lǐnɡ': 0, 'liú': 0, 'liù': 0, 'liǔ': 0, 'liū': 0, 'lō': 0, 'lónɡ': 0, 'lònɡ': 0, 'lǒnɡ': 0, 'lóu': 0, 'lòu': 0, 'lǒu': 0, 'lou0': 0, 'lu': 0, 'lú': 0, 'lù': 0, 'lǔ': 0, 'lū': 0, 'lǘ': 0, 'lǜ': 0, 'lǚ': 0, 'luán': 0, 'luàn': 0, 'luǎn': 0, 'lüè': 0, 'lüě': 0, 'lún': 0, 'lùn': 0, 'lǔn': 0, 'luó': 0, 'luò': 0, 'luǒ': 0, 'luō': 0, 'lǜ亇ma': 0, 'ma': 0, 'má': 0, 'mà': 0, 'mǎ': 0, 'mā': 0, 'mái': 0, 'mài': 0, 'mǎi': 0, 'mán': 0, 'màn': 0, 'mǎn': 0, 'mān': 0, 'mánɡ': 0, 'mǎnɡ': 0, 'mānɡ': 0, 'manɡmi': 0, 'máo': 0, 'mào': 0, 'mǎo': 0, 'māo': 0, 'mas': 0, 'me': 0, 'mè': 0, 'mē': 0, 'méi': 0, 'mèi': 0, 'měi': 0, 'mén': 0, 'mèn': 0, 'mēn': 0, 'ménɡ': 0, 'mènɡ': 0, 'měnɡ': 0, 'mēnɡ': 0, 'meo': 0, 'mí': 0, 'mì': 0, 'mǐ': 0, 'mī': 0, 'mián': 0, 'miàn': 0, 'miǎn': 0, 'miáo': 0, 'miào': 0, 'miǎo': 0, 'miāo': 0, 'miè': 0, 'miē': 0, 'miliklanm': 0, 'mín': 0, 'mǐn': 0, 'mínɡ': 0, 'mìnɡ': 0, 'mǐnɡ': 0, 'miù': 0, 'mó': 0, 'mò': 0, 'mǒ': 0, 'mō': 0, 'mol': 0, 'móu': 0, 'mǒu': 0, 'mōu': 0, 'mú': 0, 'mù': 0, 'mǔ': 0, 'myeo': 0, 'myeon': 0, 'ná': 0, 'nà': 0, 'nǎ': 0, 'nai': 0, 'nái': 0, 'nǎi': 0, 'nán': 0, 'nàn': 0, 'nǎn': 0, 'nān': 0, 'nánɡ': 0, 'nànɡ': 0, 'nǎnɡ': 0, 'nānɡ': 0, 'náo': 0, 'nào': 0, 'nǎo': 0, 'nāo': 0, 'ne': 0, 'nè': 0, 'nèi': 0, 'něi': 0, 'nem': 0, 'nèn': 0, 'nénɡ': 0, 'neus': 0, 'nɡaɡ': 0, 'nɡai': 0, 'nɡam': 0, 'ní': 0, 'nì': 0, 'nǐ': 0, 'nī': 0, 'nián': 0, 'niàn': 0, 'niǎn': 0, 'niān': 0, 'niánɡ': 0, 'niànɡ': 0, 'niào': 0, 'niǎo': 0, 'niè': 0, 'niē': 0, 'nín': 0, 'nǐn': 0, 'nīn': 0, 'nínɡ': 0, 'nìnɡ': 0, 'nǐnɡ': 0, 'niú': 0, 'niù': 0, 'niǔ': 0, 'niū': 0, 'nónɡ': 0, 'nònɡ': 0, 'nǒnɡ': 0, 'nóu': 0, 'nòu': 0, 'nǒu': 0, 'nú': 0, 'nù': 0, 'nǔ': 0, 'nǜ': 0, 'nǚ': 0, 'nuán': 0, 'nuǎn': 0, 'nüè': 0, 'nun': 0, 'nunɡ': 0, 'nuó': 0, 'nuò': 0, 'nuǒ': 0, 'o': 0, 'ò': 0, 'ō': 0, 'oes': 0, 'ol': 0, 'ōn': 0, 'óu': 0, 'òu': 0, 'ǒu': 0, 'ōu': 0, 'pá': 0, 'pà': 0, 'pā': 0, 'pai': 0, 'pái': 0, 'pāi': 0, 'pak': 0, 'pán': 0, 'pàn': 0, 'pǎn': 0, 'pān': 0, 'pánɡ': 0, 'pànɡ': 0, 'pǎnɡ': 0, 'pānɡ': 0, 'páo': 0, 'pào': 0, 'pǎo': 0, 'pāo': 0, 'péi': 0, 'pèi': 0, 'pěi': 0, 'pēi': 0, 'pén': 0, 'pěn': 0, 'pēn': 0, 'pénɡ': 0, 'pènɡ': 0, 'pěnɡ': 0, 'pēnɡ': 0, 'phas': 0, 'phdenɡ': 0, 'phoi': 0, 'phos': 0, 'pi': 0, 'pí': 0, 'pì': 0, 'pǐ': 0, 'pī': 0, 'pián': 0, 'piàn': 0, 'piǎn': 0, 'piān': 0, 'piáo': 0, 'piào': 0, 'piǎo': 0, 'piāo': 0, 'piě': 0, 'piē': 0, 'pín': 0, 'pìn': 0, 'pǐn': 0, 'pīn': 0, 'pínɡ': 0, 'pīnɡ': 0, 'po': 0, 'pó': 0, 'pò': 0, 'pǒ': 0, 'pō': 0, 'póu': 0, 'pǒu': 0, 'pōu': 0, 'ppun': 0, 'pu': 0, 'pú': 0, 'pù': 0, 'pǔ': 0, 'pū': 0, 'qí': 0, 'qì': 0, 'qǐ': 0, 'qī': 0, 'qiá': 0, 'qià': 0, 'qiǎ': 0, 'qiā': 0, 'qián': 0, 'qiàn': 0, 'qiǎn': 0, 'qiān': 0, 'qiánɡ': 0, 'qiànɡ': 0, 'qiǎnɡ': 0, 'qiānɡ': 0, 'qiáo': 0, 'qiào': 0, 'qiǎo': 0, 'qiāo': 0, 'qié': 0, 'qiè': 0, 'qiě': 0, 'qiē': 0, 'qín': 0, 'qìn': 0, 'qǐn': 0, 'qīn': 0, 'qínɡ': 0, 'qìnɡ': 0, 'qǐnɡ': 0, 'qīnɡ': 0, 'qionɡ': 0, 'qiónɡ': 0, 'qiú': 0, 'qiǔ': 0, 'qiū': 0, 'qú': 0, 'qù': 0, 'qǔ': 0, 'qū': 0, 'quán': 0, 'quàn': 0, 'quǎn': 0, 'quān': 0, 'qué': 0, 'què': 0, 'quē': 0, 'qún': 0, 'qūn': 0, 'ra': 0, 'ram': 0, 'rán': 0, 'rǎn': 0, 'ránɡ': 0, 'rànɡ': 0, 'rǎnɡ': 0, 'ráo': 0, 'rào': 0, 'rǎo': 0, 'rè': 0, 'rě': 0, 'ren': 0, 'rén': 0, 'rèn': 0, 'rěn': 0, 'rénɡ': 0, 'rēnɡ': 0, 'rì': 0, 'rónɡ': 0, 'rònɡ': 0, 'rǒnɡ': 0, 'róu': 0, 'ròu': 0, 'rǒu': 0, 'rú': 0, 'rù': 0, 'rǔ': 0, 'rū': 0, 'ruán': 0, 'ruǎn': 0, 'ruí': 0, 'ruì': 0, 'ruǐ': 0, 'rùn': 0, 'ruò': 0, 'sà': 0, 'sǎ': 0, 'sā': 0, 'sài': 0, 'sǎi': 0, 'sāi': 0, 'san': 0, 'sàn': 0, 'sǎn': 0, 'sān': 0, 'sànɡ': 0, 'sǎnɡ': 0, 'sānɡ': 0, 'sào': 0, 'sǎo': 0, 'sāo': 0, 'sè': 0, 'sed': 0, 'sēn': 0, 'sēnɡ': 0, 'seo': 0, 'seon': 0, 'shá': 0, 'shà': 0, 'shǎ': 0, 'shā': 0, 'shai': 0, 'shāi': 0, 'shàn': 0, 'shǎn': 0, 'shān': 0, 'shanɡ': 0, 'shànɡ': 0, 'shǎnɡ': 0, 'shānɡ': 0, 'sháo': 0, 'shào': 0, 'shǎo': 0, 'shāo': 0, 'shé': 0, 'shè': 0, 'shě': 0, 'shē': 0, 'shen': 0, 'shén': 0, 'shèn': 0, 'shěn': 0, 'shēn': 0, 'shénɡ': 0, 'shènɡ': 0, 'shěnɡ': 0, 'shēnɡ': 0, 'shi': 0, 'shí': 0, 'shì': 0, 'shǐ': 0, 'shī': 0, 'shòu': 0, 'shǒu': 0, 'shōu': 0, 'shú': 0, 'shù': 0, 'shǔ': 0, 'shū': 0, 'shuà': 0, 'shuǎ': 0, 'shuā': 0, 'shuài': 0, 'shuǎi': 0, 'shuāi': 0, 'shuàn': 0, 'shuān': 0, 'shuànɡ': 0, 'shuǎnɡ': 0, 'shuānɡ': 0, 'shuí': 0, 'shuì': 0, 'shuǐ': 0, 'shùn': 0, 'shǔn': 0, 'shuò': 0, 'shuō': 0, 'sì': 0, 'sǐ': 0, 'sī': 0, 'so': 0, 'sol': 0, 'sònɡ': 0, 'sǒnɡ': 0, 'sōnɡ': 0, 'sòu': 0, 'sǒu': 0, 'sōu': 0, 'sú': 0, 'sù': 0, 'sū': 0, 'suàn': 0, 'suǎn': 0, 'suān': 0, 'suí': 0, 'suì': 0, 'suǐ': 0, 'suī': 0, 'sún': 0, 'sùn': 0, 'sǔn': 0, 'sūn': 0, 'suò': 0, 'suǒ': 0, 'suō': 0, 'ta': 0, 'tá': 0, 'tà': 0, 'tǎ': 0, 'tā': 0, 'tae': 0, 'tái': 0, 'tài': 0, 'tǎi': 0, 'tāi': 0, 'tán': 0, 'tàn': 0, 'tǎn': 0, 'tān': 0, 'tánɡ': 0, 'tànɡ': 0, 'tǎnɡ': 0, 'tānɡ': 0, 'táo': 0, 'tào': 0, 'tǎo': 0, 'tāo': 0, 'tap': 0, 'tè': 0, 'ténɡ': 0, 'tènɡ': 0, 'tēnɡ': 0, 'teo': 0, 'teul': 0, 'tí': 0, 'tì': 0, 'tǐ': 0, 'tī': 0, 'tián': 0, 'tiàn': 0, 'tiǎn': 0, 'tiān': 0, 'tiáo': 0, 'tiào': 0, 'tiǎo': 0, 'tiāo': 0, 'tiè': 0, 'tiě': 0, 'tiē': 0, 'tínɡ': 0, 'tǐnɡ': 0, 'tīnɡ': 0, 'tol': 0, 'tónɡ': 0, 'tònɡ': 0, 'tǒnɡ': 0, 'tōnɡ': 0, 'tóu': 0, 'tòu': 0, 'tǒu': 0, 'tōu': 0, 'tú': 0, 'tù': 0, 'tǔ': 0, 'tū': 0, 'tuán': 0, 'tuàn': 0, 'tuǎn': 0, 'tuān': 0, 'tuí': 0, 'tuì': 0, 'tuǐ': 0, 'tuī': 0, 'tún': 0, 'tǔn': 0, 'tūn': 0, 'tuó': 0, 'tuò': 0, 'tuǒ': 0, 'tuō': 0, 'uu': 0, 'wa': 0, 'wá': 0, 'wà': 0, 'wǎ': 0, 'wā': 0, 'wài': 0, 'wǎi': 0, 'wāi': 0, 'wán': 0, 'wàn': 0, 'wǎn': 0, 'wān': 0, 'wánɡ': 0, 'wànɡ': 0, 'wǎnɡ': 0, 'wānɡ': 0, 'wéi': 0, 'wèi': 0, 'wěi': 0, 'wēi': 0, 'wén': 0, 'wèn': 0, 'wěn': 0, 'wēn': 0, 'wènɡ': 0, 'wěnɡ': 0, 'wēnɡ': 0, 'wó': 0, 'wò': 0, 'wǒ': 0, 'wō': 0, 'wú': 0, 'wù': 0, 'wǔ': 0, 'wū': 0, 'xí': 0, 'xì': 0, 'xǐ': 0, 'xī': 0, 'xiá': 0, 'xià': 0, 'xiā': 0, 'xián': 0, 'xiàn': 0, 'xiǎn': 0, 'xiān': 0, 'xiánɡ': 0, 'xiànɡ': 0, 'xiǎnɡ': 0, 'xiānɡ': 0, 'xiáo': 0, 'xiào': 0, 'xiǎo': 0, 'xiāo': 0, 'xié': 0, 'xiè': 0, 'xiě': 0, 'xiē': 0, 'xin': 0, 'xín': 0, 'xìn': 0, 'xǐn': 0, 'xīn': 0, 'xínɡ': 0, 'xìnɡ': 0, 'xǐnɡ': 0, 'xīnɡ': 0, 'xiónɡ': 0, 'xiònɡ': 0, 'xiōnɡ': 0, 'xiú': 0, 'xiù': 0, 'xiǔ': 0, 'xiū': 0, 'xu': 0, 'xú': 0, 'xù': 0, 'xǔ': 0, 'xū': 0, 'xuán': 0, 'xuàn': 0, 'xuǎn': 0, 'xuān': 0, 'xué': 0, 'xuè': 0, 'xuě': 0, 'xuē': 0, 'xún': 0, 'xùn': 0, 'xūn': 0, 'ya': 0, 'yá': 0, 'yà': 0, 'yǎ': 0, 'yā': 0, 'yan': 0, 'yán': 0, 'yàn': 0, 'yǎn': 0, 'yān': 0, 'yánɡ': 0, 'yànɡ': 0, 'yǎnɡ': 0, 'yānɡ': 0, 'yáo': 0, 'yào': 0, 'yǎo': 0, 'yāo': 0, 'ye': 0, 'yé': 0, 'yè': 0, 'yě': 0, 'yē': 0, 'yen': 0, 'yí': 0, 'yì': 0, 'yǐ': 0, 'yī': 0, 'yin': 0, 'yín': 0, 'yìn': 0, 'yǐn': 0, 'yīn': 0, 'yínɡ': 0, 'yìnɡ': 0, 'yǐnɡ': 0, 'yīnɡ': 0, 'yō': 0, 'yónɡ': 0, 'yònɡ': 0, 'yǒnɡ': 0, 'yōnɡ': 0, 'yóu': 0, 'yòu': 0, 'yǒu': 0, 'yōu': 0, 'yú': 0, 'yù': 0, 'yǔ': 0, 'yū': 0, 'yuán': 0, 'yuàn': 0, 'yuǎn': 0, 'yuān': 0, 'yue': 0, 'yuè': 0, 'yuē': 0, 'yún': 0, 'yùn': 0, 'yǔn': 0, 'yūn': 0, 'zá': 0, 'zǎ': 0, 'zā': 0, 'zai': 0, 'zài': 0, 'zǎi': 0, 'zāi': 0, 'zán': 0, 'zàn': 0, 'zǎn': 0, 'zān': 0, 'zànɡ': 0, 'zǎnɡ': 0, 'zānɡ': 0, 'záo': 0, 'zào': 0, 'zǎo': 0, 'zāo': 0, 'zé': 0, 'zè': 0, 'zē': 0, 'zéi': 0, 'zèn': 0, 'zěn': 0, 'zènɡ': 0, 'zěnɡ': 0, 'zēnɡ': 0, 'zha': 0, 'zhá': 0, 'zhà': 0, 'zhǎ': 0, 'zhā': 0, 'zhai': 0, 'zhái': 0, 'zhǎi': 0, 'zhāi': 0, 'zhán': 0, 'zhàn': 0, 'zhǎn': 0, 'zhān': 0, 'zhànɡ': 0, 'zhǎnɡ': 0, 'zhānɡ': 0, 'zhào': 0, 'zhǎo': 0, 'zhāo': 0, 'zhe': 0, 'zhé': 0, 'zhè': 0, 'zhě': 0, 'zhē': 0, 'zhén': 0, 'zhèn': 0, 'zhěn': 0, 'zhēn': 0, 'zhènɡ': 0, 'zhěnɡ': 0, 'zhēnɡ': 0, 'zhí': 0, 'zhì': 0, 'zhǐ': 0, 'zhī': 0, 'zhònɡ': 0, 'zhǒnɡ': 0, 'zhōnɡ': 0, 'zhóu': 0, 'zhòu': 0, 'zhǒu': 0, 'zhōu': 0, 'zhú': 0, 'zhù': 0, 'zhǔ': 0, 'zhū': 0, 'zhuā': 0, 'zhuài': 0, 'zhuǎi': 0, 'zhuàn': 0, 'zhuǎn': 0, 'zhuān': 0, 'zhuànɡ': 0, 'zhuānɡ': 0, 'zhuì': 0, 'zhuǐ': 0, 'zhuī': 0, 'zhǔn': 0, 'zhūn': 0, 'zhuó': 0, 'zhuō': 0, 'zì': 0, 'zǐ': 0, 'zī': 0, 'zo': 0, 'zònɡ': 0, 'zǒnɡ': 0, 'zōnɡ': 0, 'zòu': 0, 'zǒu': 0, 'zōu': 0, 'zú': 0, 'zǔ': 0, 'zū': 0, 'zuàn': 0, 'zuǎn': 0, 'zuān': 0, 'zuì': 0, 'zuǐ': 0, 'zuī': 0, 'zùn': 0, 'zǔn': 0, 'zūn': 0, 'zuó': 0, 'zuò': 0, 'zuǒ': 0}

    print(get_dict_2(key_1, f1))


#############################  修改话术
    # file_name = 'sub-new-1.csv'
    # target = os.path.join('/Users/edz/Desktop', file_name)
    # with open(target, 'w+') as f1:
    #     # writer = csv.writer(f1)
    #     # 获取文件内容
    #     file_path = '/Users/edz/Desktop/Sentence-2018-11-15.csv'
    #     file_lines = open(file_path)
    #
    #     for line in file_lines:
    #         print(line)
    #         for i in line.split(',')[1:] :
    #             print(i)
    #             i =re.sub("[\s+\.\!\/_,$%^*(+\"\']+|[+——！，。？、~@#￥%……&*（）()<>{}「」《》' ：:]+", "",i)
    #             f1.write(i)
##############################



    # get_dict(pykey, data)
